Revit 2024 API
ParameterFilterRuleFactory.CreateIsNotAssociatedWithGlobalParameterRule Method
 Creates a filter rule that determines whether a parameter is not associated with a certain global parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static FilterRule CreateIsNotAssociatedWithGlobalParameterRule(
	ElementId parameter,
	ElementId value
)
Visual Basic
Public Shared Function CreateIsNotAssociatedWithGlobalParameterRule ( _
	parameter As ElementId, _
	value As ElementId _
) As FilterRule
Visual C++
public:
static FilterRule^ CreateIsNotAssociatedWithGlobalParameterRule(
	ElementId^ parameter,
	ElementId^ value
)
Parameters
parameter
Type: Autodesk.Revit.DB.ElementId
 A parameter that can be associated with an existing global parameter of a compatible type.
value
Type: Autodesk.Revit.DB.ElementId
 The global parameter used to test the association.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ParameterFilterRuleFactory Class
Autodesk.Revit.DB Namespace